Repository: ShoaibGujjar/Glubble_multilingual
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: Popular Comparisons
ar: المقارنات الشائعة
fr: Comparaisons populaires

source: Find out which of the 2 GPUs performs better, view a side-by-side specification comparison.
ar: اعرف أي من بين البطاقات الرسومية الاثنتين أفضل أداء، وشاهد المقارنة الجانبية للمواصفات.
fr: Découvrez laquelle des 2 cartes graphiques a de meilleures performances, consultez une comparaison détaillée côte à côte des spécifications.

source: VS
ar: مقابل

source: Compare Two GPUs
ar: مقارنة بين بطاقتي رسومات
fr: Comparer deux cartes graphiques

source: Year
ar: السنة
fr: Année

source: Buy Now
ar: اشترِ الآن

source: Changement
ar: التغيير

source: Comparer
ar: مقارنة

source: Winner
ar: الفائز
fr: Vainqueur

source: Release Date
ar: تاريخ الإصدار
fr: Date de sortie

source: Generation
ar: الجيل
fr: Génération

source: price
ar: السعر
fr: Prix

source: Power Connectors
ar: موصلات الطاقة
fr: Connecteurs d'alimentation

source: Memory Size
ar: حجم الذاكرة
fr: Taille de la mémoire

source: Bandwidth
ar: عرض النطاق الترددي
fr: Bande passante

source: Memory Bus
ar: حافلة الذاكرة
fr: Bus de mémoire

source: Core Clock Speed
ar: سرعة ساعة النواة
fr: Vitesse d'horloge du cœur

source: Boost Clock Speed
ar: سرعة ساعة التسريع
fr: Vitesse d'horloge Turbo

source: Memory Clock Speed
ar: سرعة ساعة الذاكرة
fr: Vitesse d'horloge de la mémoire

source: Chip lithography
ar: النحت على الرقاقة
fr: Lithographie de la puce

source: Benchmark performance
ar: أداء البنكمارك
fr: Performance de référence

source: Gaming
ar: الألعاب
fr: Jeux

source: Average FPS
ar: متوسط FPS
fr: FPS moyens

source: Popular Games
ar: ألعاب شعبية
fr: Jeux populaires

source: Choose a Game
ar: اختر لعبة
fr: Choisir un jeu

source: Official system requirements
ar: متطلبات النظام الرسمية
fr: Configuration minimale requise

source: FPS benchmarks
ar: مقاييس FPS
fr: Références FPS

source: Competitors of
ar: منافسو
fr: Concurrents de

source: by AMD
ar: بواسطة AMD
fr: par AMD

source: Here are some closest AMD rivals to
ar: فيما يلي بعض المنافسين الأقرب لـ AMD لـ
fr: Voici les concurrents les plus proches d'AMD pour

source: Developer
ar: المطور
fr: Développeur

source: Publisher
ar: الناشر
fr: Éditeur

source: Release date:
ar: تاريخ الإصدار:
fr: Date de sortie :

source: Metacritic rating
ar: تقييم ميتاكريتيك
fr: Note Metacritic

source: Our user rating
ar: تقييم المستخدمين لدينا
fr: Notre note utilisateur

source: Copyright © CurrentCopyrightYear. Created By
ar: حقوق النشر © سنة الحقوق الحالية. تم إنشاء الموقع بواسطة
fr: Droits d'auteur © CurrentCopyrightYear. Créé par

source: About
ar: حول الموقع
fr: À propos

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Contact
ar: اتصل بنا

source: COMPARER
ar: مقارنة البطاقات الرسومية

source: Brand
ar: العلامة التجارية
fr: Marque

source: Name
ar: الاسم
fr: Nom

source: Performance
ar: الأداء

source: Price
ar: السعر
fr: Prix

source: Add Graphics card from table
ar: إضافة بطاقة رسومية من الجدول
fr: Ajouter une carte graphique à partir du tableau

source: Compare
ar: مقارنة
fr: Comparer

source: General
ar: عام
fr: Général

source: Market segment
ar: شريحة السوق
fr: Segment de marché

source: GPU code name
ar: اسم الشفرة لوحدة معالجة الرسوميات (GPU)
fr: Nom de code GPU

source: Architecture
ar: البنية التحتية

source: Memory
ar: الذاكرة
fr: Mémoire

source: Memory Type
ar: نوع الذاكرة
fr: Type de mémoire

source: Memory Bandwidth
ar: عرض النطاق الترددي للذاكرة
fr: Bande passante de mémoire

source: Memory clock speed
ar: سرعة ساعة الذاكرة
fr: Vitesse d'horloge de la mémoire

source: Technical specs
ar: المواصفات الفنية
fr: Spécifications techniques

source: Pipelines / CUDA cores
ar: أنابيب / نوى CUDA
fr: Pipelines / Cœurs CUDA

source: Core clock speed
ar: سرعة تشغيل النواة
fr: Vitesse d'horloge du processeur

source: Thermal design power (TDP)
ar: الطاقة الحرارية المصممة (TDP)
fr: Puissance de conception thermique (TDP)

source: Manufacturing process technology
ar: تقنية عملية التصنيع
fr: Technologie de processus de fabrication

source: Number of transistors
ar: عدد الترانزستورات
fr: Nombre de transistors

source: Texture Fill rate
ar: معدل ملء الأسطح
fr: Taux de remplissage de texture

source: Relative perfomance
ar: الأداء النسبي
fr: Performance relative

source: performance compare to nearest competitors
ar: مقارنة الأداء بأقرب المنافسين
fr: performance comparée aux concurrents les plus proches

source: AND equivalent
ar: المكافئ AND
fr: équivalent AND

source: GPU processors
ar: معالجات الرسومات
fr: Processeurs GPU

source: Recommended processors
ar: المعالجات الموصى بها
fr: Processeurs recommandés

source: KNOWLEDGE CENTER
ar: مركز المعرفة
fr: CENTRE DE CONNAISSANCES

source: GENERAL QUERIES
ar: الاستفسارات العامة
fr: QUESTIONS GÉNÉRALES

source: GRAPHIC CARDS
ar: بطاقات الرسومات
fr: CARTES GRAPHIQUES

source: this is some random text
fr: oui
